"""

	twisted

		twisted - асинхронный фреймворк для работы с сетями, управляемый событиями.
							Мы подключаем функции к событиям (полчение данных, закрытие соединения...),
							затем эти ф-ции вызываются, когда случается событие (callback)

		Установка (возможно еще не доступен для python 3):
			pip install twisted					

		Пакет twisted поддерживает множестов интернет-протоколов по типу TCP и UDP.
			Создание клиента и сервера на базе twisted.:
				knock_server.py
				knock_client.py

"""