
"""
	Структурированные бинарные файлы

		Сущестуют некоторые файловые форматы, задача которых хранить определенные структуры данных.
		 + Microsoft Excel (Самый яркий пример)
		 + HDF5 - бинарный формат, предназначенный для храненя многомерных или иерархических числовых данных.
		 					Обынчно использвется в научных целях, где треуется бысрый доступ к большим объемам данных.
		 					Подходит для WORM приложений (write once, read many).
		 					Модули для Python : h5py, PyTables
		 					Пример: Million Song Dataset


"""